3A/MATH213/Basic-Control-Theory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-09 Sat 16:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Basic Control Theory</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Basic Control Theory</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org32faf1d">1. Basics of Closed Control Loops</a>
<ul>
<li><a href="#org0628b7a">1.1. Open Loop Controller</a></li>
<li><a href="#org4948519">1.2. Closed Loop Controller</a></li>
</ul>
</li>
<li><a href="#org4de69d9">2. Proportional and Integral Control Systems</a>
<ul>
<li><a href="#orge8b86c9">2.1. Proportional Control</a>
<ul>
<li><a href="#orgc5b033d">2.1.1. Idea</a></li>
<li><a href="#orgdd0b9f4">2.1.2. Limitations</a></li>
</ul>
</li>
<li><a href="#org9826fda">2.2. Integral Controllers</a>
<ul>
<li><a href="#org783285e">2.2.1. Limitations</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org32faf1d" class="outline-2">
<h2 id="org32faf1d"><span class="section-number-2">1.</span> Basics of Closed Control Loops</h2>
<div class="outline-text-2" id="text-1">
<p>
Input can be split up into terms that can be controlled and terms that can&rsquo;t be controlled.
\[
f(t) = u(t) + d(t)
\]
where \(u(t)\) is the control input and \(d(t)\) is the disturbance input.
</p>

<p>
The goal here is find \(u(t)\) such that the output follows some given reference, and this
can be done with a controller.
</p>
</div>
<div id="outline-container-org0628b7a" class="outline-3">
<h3 id="org0628b7a"><span class="section-number-3">1.1.</span> Open Loop Controller</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The cruise control velocity system can be controlled with an open loop controller,
where:
</p>
<ul class="org-ul">
<li>\(U(s)\) is the Laplace transform of the control input</li>
<li>\(D(s)\) is the Laplace transform of the disturbance input</li>
<li>\(F(s)\) is the Laplace transform of the total forcing term</li>
<li>\(V(s)\) is the Laplace transform of the resulting velocity</li>
</ul>
<p>
and \(F(s)\) and \(V(s)\) are related by the transfer function.
</p>

<p>
These controllers only work well if we know the disturbance the system undergoes, if the
system always needs a constant known output, or if the user can make adjustments as
needed.
</p>
</div>
</div>
<div id="outline-container-org4948519" class="outline-3">
<h3 id="org4948519"><span class="section-number-3">1.2.</span> Closed Loop Controller</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Output is fed back into controller and error is calculated from this based on difference
from the reference.
A controller is also added to dynamically adjust \(U(s)\) based on feedback.
</p>

<p>
The new goal is to find a transfer function \(C(s)\) such that the error goes to 0.
</p>
</div>
</div>
</div>
<div id="outline-container-org4de69d9" class="outline-2">
<h2 id="org4de69d9"><span class="section-number-2">2.</span> Proportional and Integral Control Systems</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orge8b86c9" class="outline-3">
<h3 id="orge8b86c9"><span class="section-number-3">2.1.</span> Proportional Control</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgc5b033d" class="outline-4">
<h4 id="orgc5b033d"><span class="section-number-4">2.1.1.</span> Idea</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Let \(u(t) = k_{p} e(t)\) for \(k_{p} \in \mathbb{R}_{>0}\), then
</p>
<ul class="org-ul">
<li>if \(e(t) > 0\), increase \(u(t)\)</li>
<li>if \(e(t) < 0\), decrease \(u(t)\),</li>
<li>if \(e(t) = 0\) do nothing</li>
</ul>

<p>
For this controller, \(k_{p}\) is the transfer function \(C(s)\).
</p>

<p>
For the cruise control velocity controller (with no disturbance),
the transfer function for the controlled system becomes
\[
H_{RV}(s) = \frac{k_{p}/(b + k_{p})}{[m/(b+k_{p})]s + 1}
\]
which is the transfer function for a first order system with a DC gain of
\[
\kappa = \frac{k_{p}}{b + k_{p}}
\]
and a time constant of
\[
\tau = \frac{m}{b + k_{p}}
\]
This is the same as the uncontrolled transfer function, but the DC gain and time
constant can be adjusted through \(k_{p}\).
</p>

<p>
For a system with disturbance, transfer function is \(H_{DV}(s)\) with the
same system.
This gives the net response to be
\[
V(s) = H_{RV}(s) R(s) + H_{DV}(s) D(s)
\]
</p>

<p>
For larger values of \(k_{p}\), \(\tau\) becomes smaller which leads to faster decay to
the final value of ths system.
</p>

<p>
By changing \(k_{p}\), can make \(\kappa\) obtain any value between 0 and 1.
</p>
</div>
</div>
<div id="outline-container-orgdd0b9f4" class="outline-4">
<h4 id="orgdd0b9f4"><span class="section-number-4">2.1.2.</span> Limitations</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
If \(e(t)\) is ever 0, then \(u(t) = k_{p}r(t) = 0\).
Thus, in the absence of any disturbance to the system, the input into the system
\(f(t)\) also vanishes, and so no system input means \(v(t)\) will drop since \(b > 0\).
</p>

<p>
This means \(p\) controllers can never achieve perfect asymptotic velocity.
</p>
</div>
</div>
</div>
<div id="outline-container-org9826fda" class="outline-3">
<h3 id="org9826fda"><span class="section-number-3">2.2.</span> Integral Controllers</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Let the error term be proportional to the integral of the error
\[
c(t) = k_{i} \int_{0}^{t} e(\tau) d\tau
\]
which goes to 0 exactly when average error is 0, and so it can bring the asymptotic
error to exactly 0.
</p>

<p>
The transfer function for the integral term is \(C(s) = \frac{k_{i}}{s}\) and so
\[
V(s) = \frac{P(s)C(s)}{1 + P(s) C(s)}R(s)
\]
and so the new system has a transfer function of
\[
H(s) = \frac{k_{i}/m}{s^{2} + \frac{b}{m}s + \frac{k_{i}}{m}}
\]
which is the transfer function for a second order system.
</p>

<p>
The DC gain is \(H(0) = 1\).
</p>
</div>
<div id="outline-container-org783285e" class="outline-4">
<h4 id="org783285e"><span class="section-number-4">2.2.1.</span> Limitations</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Since we adjust based on the integral in the error, integral controllers do
strongly quickly adjust to changes.
</p>

<p>
Leads to potential overshoot of the goal, which is in part because solutions
generally come in conjugate pairs and so the solution will have sinusoidal
terms that will decay to 0.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-03-09 Sat 16:47</p>
</div>
</body>
</html>
